tinder2/app/controllers/comentarios_controller.rb

  def index
    @comentarios = Comentario.all
---
SELECT "comentarios".* FROM "comentarios"

  def create
    comentario_params = params.require(:comentario).permit(:contenido)
    @comentario = Comentario.create(comentario_params)
---
INSERT INTO "comentarios" ("rid", "uid", "contenido", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rid", 2], ["uid", 1], ["contenido", "pojgf"], ["created_at", "2020-05-07 16:36:59.708741"], ["updated_at", "2020-05-07 16:36:59.708741"]]

  def show
    @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def edit
    @comentario = Comentario.find(params[:id])
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    comentario_params = params.require(:comentario).permit(:comentario)
    @comentario = Comentario.find(params[:id])

    if @comentario.update(comentario_params)
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "comentarios" SET "contenido" = $1, "updated_at" = $2 WHERE "comentarios"."id" = $3  [["contenido", "sdge"], ["updated_at", "2020-05-07 16:48:11.053853"], ["id", 7]]

  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy
---
SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "comentarios" WHERE "comentarios"."id" = $1  [["id", 5]]