tinder2/app/controllers/comunas_controller.rb

INSERT INTO "comunas" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "kjg"], ["created_at", "2020-05-07 16:52:28.627636"], ["updated_at", "2020-05-07 16:52:28.627636"]]
---
  def create
    comuna_params = params.require(:comuna).permit(:nombre)
    @comuna = Comuna.create(comuna_params)

SELECT "comunas".* FROM "comunas"
---
  def index
    @comunas = Comuna.all

SELECT  "comunas".* FROM "comunas" WHERE "comunas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @comuna = Comuna.find(params[:id])