tinder2/app/controllers/cuenta_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "contacto" = $1, "comuna" = $2 WHERE "users"."id" = $3  [["contacto", "6767676"], ["comuna", "slf"], ["id", 5]]
---
    def update
    puts "primeeer holaaaaaa"

    cuenta_params = params.require(:user).permit(:nombre, :apellidos, :username, :email, :sexo, :tipo)
    puts "segunso gollaaaaa"
    puts cuenta_params
    @user = User.find(current_user.id)



    if @user.update(cuenta_params)