tinder2/app/controllers/gustos_controller.rb

  def index
    @gustos = Gusto.all
---
SELECT "gustos".* FROM "gustos"