tinder2/app/controllers/meetings_controller.rb

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @meeting = Meeting.find(params[:id])

INSERT INTO "meetings" ("usuario1", "ususario2", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["usuario1", "dfsg"], ["ususario2", "sadf"], ["created_at", "2020-05-07 17:21:50.508314"], ["updated_at", "2020-05-07 17:21:50.508314"]]
---
  def create
    meeting_params = params.require(:meeting).permit(:usuario1, :usuario2)
    @meeting = Meeting.create(meeting_params)

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @meeting = Meeting.find(params[:id])

SELECT  "meetings".* FROM "meetings" WHERE "meetings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "meetings" WHERE "meetings"."id" = $1  [["id", 1]]
---
  def destroy
    @meeting = Meeting.find(params[:id])
    @meeting.destroy