tinder2/app/controllers/restaurants_controller.rb

  def create
    restaurant_params = params.require(:restaurant).permit(:nombre, :valoracion, :comentarios, :descripcion)
    @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("nombre", "valoracion", "comentarios", "descripcion", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nombre", "dfg"], ["valoracion", 5.0], ["comentarios", "sfsfg"], ["descripcion", "sfgwerg"], ["created_at", "2020-05-07 17:03:42.065101"], ["updated_at", "2020-05-07 17:03:42.065101"]]

  def update
    restaurant_params = params.require(:restaurant).permit(:nombre, :valoracion, :comentarios, :descripcion)
    @restaurant = Restaurant.find(params[:id])
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]